In [1]:
import pandas as pd

In [2]:
dict1 = {'Name' : ['Priyang', 'Aadhya', 'Krishna','Vedant','Parshv',
                   'Mittal', 'Swarali'],
         'Marks' : [98,89,87,99,90,83,99],
         'Gender' : ['Male','Female','Female','Male','Male',
                     'Female','Female']
        }

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     87  Female
3   Vedant     99    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Swarali     99  Female

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     87  Female

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Swarali     99  Female

In [5]:
df1.shape

(7, 3)

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [8]:
df1.isna()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False